InformationRegisters/ЦеныПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПоставщиков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтклонениеПлюс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтклонениеМинус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальныйЗаказ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВесТоварПлюс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Допуск</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id_price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИзменениеЗакупочныхЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗапретИзмененияЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗапретИзмененияЦены</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СпецификацииПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СпецификацииПоставщиков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураСырье</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныПоставщиков/Ext/RecordSetModule.bsl
Процедура ПроверитьХолдингПроизводителей(Отказ)
	
	ПустаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	
	МассивНоменклатуры 	= Новый Массив;//ЭтотОбъект.ВыгрузитьКолонку("Номенклатура");
	
	ТаблицаЗаписи = ЭтотОбъект.ВыгрузитьКолонки();
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		Если СтрокаНабора.Номенклатура.НеВедетсяУчетПоХарактеристикам Тогда
			Если НЕ СтрокаНабора.Характеристика.Пустая() Тогда
				СтрокаНабора.Характеристика = ПустаяХарактеристика;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		Если СтрокаНабора.Характеристика.Неактивная Тогда
			Продолжить;
		КонецЕсли;
		
		МассивНоменклатуры.Добавить(СтрокаНабора.Номенклатура);
		
		НоваяСтрока = ТаблицаЗаписи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНабора);
	КонецЦикла;
	
	//
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивНоменклатуры"	, МассивНоменклатуры);
	Запрос.УстановитьПараметр("ТаблицаЗаписи"		, ТаблицаЗаписи);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Объект КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК Справочник.Контрагенты).ГоловнойКонтрагент КАК Холдинг
	|ПОМЕСТИТЬ ВТПроизводители
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.Производитель)
	|	И ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Объект КАК Справочник.ХарактеристикиНоменклатуры).Владелец В (&МассивНоменклатуры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаписи.Период,
	|	ТаблицаЗаписи.Номенклатура,
	|	ТаблицаЗаписи.Характеристика,
	|	ТаблицаЗаписи.Поставщик
	|ПОМЕСТИТЬ ВТТаблицаЗаписи
	|ИЗ
	|	&ТаблицаЗаписи КАК ТаблицаЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаписи.Период,
	|	ТаблицаЗаписи.Номенклатура,
	|	ТаблицаЗаписи.Характеристика,
	|	ТаблицаЗаписи.Поставщик,
	|	ЕСТЬNULL(ВТПроизводители.Холдинг, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Холдинг
	|ПОМЕСТИТЬ ВТТаблицаЗаписи2
	|ИЗ
	|	ВТТаблицаЗаписи КАК ТаблицаЗаписи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПроизводители КАК ВТПроизводители
	|		ПО (ВТПроизводители.Характеристика = ТаблицаЗаписи.Характеристика)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныПоставщиков.Период,
	|	ЦеныПоставщиков.Поставщик,
	|	ЦеныПоставщиков.Номенклатура,
	|	ЦеныПоставщиков.Характеристика,
	|	ЕСТЬNULL(ВТПроизводители.Холдинг, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Холдинг
	|ПОМЕСТИТЬ ВТЦеныПоставщиков
	|ИЗ
	|	РегистрСведений.ЦеныПоставщиков КАК ЦеныПоставщиков
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПроизводители КАК ВТПроизводители
	|		ПО (ВТПроизводители.Характеристика = ЦеныПоставщиков.Характеристика)
	|ГДЕ
	|	ЦеныПоставщиков.Номенклатура В(&МассивНоменклатуры)
	|	И НЕ ЦеныПоставщиков.Характеристика.Неактивная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТаблицаЗаписи.Номенклатура КАК Номенклатура,
	|	ВТТаблицаЗаписи.Характеристика КАК Характеристика,
	|	ВТТаблицаЗаписи.Холдинг КАК Холдинг
	|ИЗ
	|	ВТТаблицаЗаписи2 КАК ВТТаблицаЗаписи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЦеныПоставщиков КАК ВТЦеныПоставщиков
	|		ПО ВТТаблицаЗаписи.Период = ВТЦеныПоставщиков.Период
	|			И ВТТаблицаЗаписи.Номенклатура = ВТЦеныПоставщиков.Номенклатура
	|			И ВТТаблицаЗаписи.Холдинг = ВТЦеныПоставщиков.Холдинг
	|			И (НЕ ВТТаблицаЗаписи.Характеристика = ВТЦеныПоставщиков.Характеристика)
	|ГДЕ
	|	НЕ ВТЦеныПоставщиков.Характеристика ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПроизводители
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТТаблицаЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТТаблицаЗаписи2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТЦеныПоставщиков";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Отказ = НЕ РезультатЗапроса.Пустой();
	
	Если Отказ Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщить("Для номенклатуры """ + Выборка.Номенклатура + """ (" + Выборка.Характеристика + 
						") уже установлена цена поставщиков (холдинг """ + Выборка.ГоловнойКонтрагент + """)");
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПоПравам(Отказ)
	
	Если НЕ УправлениеДопПравамиПользователей.ПолучитьПравоПользователяУпр(ПланыВидовХарактеристик.ПраваПользователей.ПолныеПраваПоРекламнымМатериалам, Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	//
	ЕстьНЕРекламныйМатериал = Ложь;
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		Если СтрокаНабора.Номенклатура.РекламныйМатериал Тогда
			Продолжить;
		КонецЕсли;
		ЕстьНЕРекламныйМатериал = Истина;
		Прервать;
	КонецЦикла;
	Если ЕстьНЕРекламныйМатериал Тогда
		Сообщить("Нет прав на запись цен поставщиков не рекламных материалов!");
		Отказ = Истина;
	//Иначе	
	//	Если ЭтотОбъект.Количество() = 0
	//			И ЭтотОбъект.Модифицированность() Тогда
	//		Сообщить("Нет прав на удаление записей цен поставщиков не рекламных материалов!");
	//		Отказ = Истина;
	//	КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, Замещение)
	
	ПустаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	ТекФЛ = ПараметрыСеанса.ТекущийПользователь.ФизЛицо;
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		//Если НЕ ЗначениеЗаполнено(Запись.Автор) Тогда
		Запись.Автор = ТекФЛ;
		//КонецЕсли;
		Если НЕ Запись.Характеристика.Пустая()
				И (Запись.Номенклатура.НеВедетсяУчетПоХарактеристикам
					ИЛИ НЕ Запись.Характеристика.Владелец = Запись.Номенклатура) Тогда
			Запись.Характеристика = ПустаяХарактеристика;
		КонецЕсли;
	КонецЦикла;	
	
	//
	ПроверитьХолдингПроизводителей(Отказ);
	
	ПроверитьПоПравам(Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	//АК БЕЛН 24.01.2016++
	МасХар = Новый Массив;
	//АК БЕЛН 24.01.2016--
	Для Каждого Запись Из ЭтотОбъект Цикл
		ЗаписиЗапрет = РегистрыСведений.ЗапретИзмененияЦены.СрезПоследних(Запись.Период, Новый Структура("Номенклатура, Характеристика", Запись.Номенклатура, Запись.Характеристика));
		Если НЕ ЗаписиЗапрет.Количество() = 0 Тогда
			Сообщить("Установлен запрет на ввод новых цен для номенклатуры " + Запись.Номенклатура + " (" + Запись.Характеристика +
						"), т.к. есть введенный документ ""Переход на свою упаковку""");
			Отказ = Истина;
		КонецЕсли;
		//АК БЕЛН 24.01.2016++
		Если ЗначениеЗаполнено(Запись.Характеристика) Тогда
			МасХар.Добавить(Запись.Характеристика);
		КонецЕсли; 
		//АК БЕЛН 24.01.2016--
	КонецЦикла;
	//АК БЕЛН 24.01.2016++
	Если НЕ Отказ Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата"	, КонецДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("МасХар"	, МасХар);
		Запрос.Текст = 
		"ВЫБРАТЬ разрешенные
		|	ЦеныПоставщиковСрезПоследних.Номенклатура,
		|	ЦеныПоставщиковСрезПоследних.Характеристика,
		|	ЦеныПоставщиковСрезПоследних.Поставщик
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	РегистрСведений.ЦеныПоставщиков.СрезПоследних(&Дата, Характеристика В (&МасХар)) КАК ЦеныПоставщиковСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ разрешенные
		|	СпецификацииПоставщиков.Период,
		|	СпецификацииПоставщиков.Поставщик,
		|	СпецификацииПоставщиков.Номенклатура,
		|	СпецификацииПоставщиков.Характеристика,
		|	СпецификацииПоставщиков.НоменклатураСырье,
		|	вт.Поставщик КАК ПоставщикПравильный
		|ИЗ
		|	РегистрСведений.СпецификацииПоставщиков.СрезПоследних(&Дата, Характеристика В (&МасХар)) КАК СпецификацииПоставщиков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО СпецификацииПоставщиков.Характеристика = вт.Характеристика
		|ГДЕ
		|	СпецификацииПоставщиков.НоменклатураСырье <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И (СпецификацииПоставщиков.ДатаКонца = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СпецификацииПоставщиков.ДатаКонца > &Дата)";
		Результат = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		РегСпецификации = РегистрыСведений.СпецификацииПоставщиков;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.Поставщик = ВыборкаДетальныеЗаписи.ПоставщикПравильный Тогда
				Продолжить;
			КонецЕсли;  	
			Попытка
				Мен = РегСпецификации.СоздатьМенеджерЗаписи();
				Мен.Период				= ВыборкаДетальныеЗаписи.период;
				Мен.Поставщик			= ВыборкаДетальныеЗаписи.Поставщик;
				Мен.Номенклатура		= ВыборкаДетальныеЗаписи.Номенклатура;
				Мен.Характеристика		= ВыборкаДетальныеЗаписи.Характеристика;
				Мен.НоменклатураСырье	= ВыборкаДетальныеЗаписи.НоменклатураСырье;
				Мен.Прочитать();
				Если Мен.Выбран() Тогда
					Мен.Поставщик		= ВыборкаДетальныеЗаписи.ПоставщикПравильный;
					Мен.Записать();
				КонецЕсли; 
			Исключение
			КонецПопытки;
		КонецЦикла;

	КонецЕсли; 
	//АК БЕЛН 24.01.2016--
	
	//+++АК mika 2018.02.08 ИП-00017505
	Попытка //Убрать попытку после подтверждения на отправки
		РегистрыСведений.ЦеныПоставщиков.ПроверкаНеобходимостиОтправикиПисьмаОПовышенииЦены(ЭтотОбъект.Выгрузить());
	Исключение
	КонецПопытки;
	//---АК mika ИП-00017505
	
КонецПроцедуры
